/* AlertText: An error occurred attempting to Restart your computer. Please restart your computer manually */
"An error occurred attempting to restart your computer. Please restart your computer manually." = "An error occurred attempting to restart your computer. Please restart your computer manually.";

/* UpdaterToolError MainText */
"An unexpected error (%d) occurred while trying to update your firmware." = "An unexpected error (%d) occurred while trying to update your firmware.";

/* GeneralError maintext */
"An unexpected error occurred (%d). Your firmware can not be updated." = "An unexpected error occurred (%d). Your firmware can not be updated.";

/* Quit Attempt MainText for dialog when attempting to quit when update has not been performed. */
"Are you sure you want to quit?" = "Are you sure you want to quit?";

/* Cancel button text */
"Cancel" = "Cancel";

/* subtext when missing resources with error code */
"item:%d" = "item:%d";

/* Dialog for if app detects that necessary resources are missing or may be corrupted, user should delete app, re-download it and run it again */
"Necessary resources are missing, corrupt, or do not have the correct permissions.  Delete the %@ and re-download it and run it again." = "Necessary resources are missing, corrupt, or do not have the correct permissions.  Delete the %@ and re-download it and run it again.";

/* OK button */
"OK" = "OK";

/* Restart button */
"Restart" = "Restart";

/* AlertSubtext: Suggest that user can - Run Software Update to check for any firmware updates for this computer */
"Run Software Update to check for any firmware updates for this computer." = "Run Software Update to check for any firmware updates for this computer.";

/* GeneralError, UpdaterToolError subtext */
"See http://support.apple.com/kb/HT3539 for more information." = "See http://support.apple.com/kb/HT3539 for more information.";

/* SubText Need to retry FULL update */
"The Lights-Out Management software will not work properly until the full update has been completed and your Xserve has been restarted." = "The Lights-Out Management software will not work properly until the full update has been completed and your Xserve has been restarted.";

/* Instructions text to LOMMainMenu.nib window */
"This application will update the Lights-Out Management firmware on your Xserve. Existing lights-out management settings will be preserved and current Server Monitor connections will be interrupted.\n\nImportant: Before proceeding with the update, it is strongly recommended that you write down your current lights-out management settings in Server Monitor.\n\nTo update your firmware click the \"Update\" button.\n\nTo update the firmware remotely, cancel from this application, log and authenticate into the remote server as an administrator using ssh and run this command:\n\nsudo /Applications/Server/Xserve\\ Lights-Out\\ Management\\ Firmware\\ Update.app/Contents/Resources/LOMFlasherTool /Applications/Server/Xserve\\ Lights-Out\\ Management\\ Firmware\\ Update.app/Contents/Resources/Xserve21_LOM_0112.bin\n\nThe update should take less than 2 minutes.\n\nFor more information see http://support.apple.com/kb/HT3539" = "This application will update the Lights-Out Management firmware on your Xserve. Existing lights-out management settings will be preserved and current Server Monitor connections will be interrupted.\n\nImportant: Before proceeding with the update, it is strongly recommended that you write down your current lights-out management settings in Server Monitor.\n\nTo update your firmware click the \"Update\" button.\n\nTo update the firmware remotely, cancel from this application, log and authenticate into the remote server as an administrator using ssh and run this command:\n\nsudo /Applications/Server/Xserve\\ Lights-Out\\ Management\\ Firmware\\ Update.app/Contents/Resources/LOMFlasherTool /Applications/Server/Xserve\\ Lights-Out\\ Management\\ Firmware\\ Update.app/Contents/Resources/Xserve21_LOM_0112.bin\n\nThe update should take less than 2 minutes.\n\nFor more information see http://support.apple.com/kb/HT3539";

/* AlertText: This 'app' does not run on this computer */
"This version of the %@ is for use with specific computer models only and will not run on this computer." = "This version of the %@ is for use with specific computer models only and will not run on this computer.";

/* AlertSubtext: Try restarting your Xserve and try again. */
"Try restarting your Xserve and try again." = "Try restarting your Xserve and try again.";

/* MainText: LOM Firmware version is unknown. */
"Unable to get your current Lights-Out Management firmware version." = "Unable to get your current Lights-Out Management firmware version.";

/* MainText can not quit while updating */
"You can not quit while your firmware is being updated." = "You can not quit while your firmware is being updated.";

/* SubText Finished update but no version available, or not expected version */
"You may need to restart your Xserve." = "You may need to restart your Xserve.";

/* GeneralError, UpdaterToolError subtext */
"You may want to restart your Xserve and try again. See http://support.apple.com/kb/HT3539 for more information." = "You may want to restart your Xserve and try again. See http://support.apple.com/kb/HT3539 for more information.";

/* AlertText: User doesn't have the minimum system required. */
"You must first install Mac OS X with a minimum of Mac OS %x.%d.%d before the %@ can be run." = "You must first install Mac OS X with a minimum of Mac OS %1$x.%2$d.%3$d before the %4$@ can be run.";

/* MainText for dialog when update is not needed */
"Your current firmware is version %@ and does not need to be updated." = "Your current firmware is version %@ and does not need to be updated.";

/* MainText Need to retry FULL update */
"Your firmware needs a 'full' update, after the update you will need to restart and re-enter the lights-out management settings in Server Monitor for your Xserve." = "Your firmware needs a 'full' update, after the update you will need to restart and re-enter the lights-out management settings in Server Monitor for your Xserve.";

/* AlertSubtext: Your firmware will not be updated */
"Your firmware will not be updated." = "Your firmware will not be updated.";

/* Up-To-Date dialog */
"Your Lights-Out Management Firmware has been updated to version %@" = "Your Lights-Out Management Firmware has been updated to version %@";

/* MainText for dialog when restart is required. */
"Your Lights-Out Management Firmware has been updated, your Xserve must now be restarted." = "Your Lights-Out Management Firmware has been updated, your Xserve must now be restarted.";

/* MainText Finished update but no version available */
"Your Lights-Out Management Firmware was updated without an error but the version is unavailable." = "Your Lights-Out Management Firmware was updated without an error but the version is unavailable.";

/* MainText:Finished update but not version we expected dialog */
"Your Lights-Out Management Firmware was updated without an error, but is showing up as version '%@', not as version '1.1.2'." = "Your Lights-Out Management Firmware was updated without an error, but is showing up as version '%@', not as version '1.1.2'.";

/* Subtext for dialog when restart is required */
"Your Lights-Out Management will not work properly until you have restarted, you will also need to re-enter the lights-out management settings in Server Monitor." = "Your Lights-Out Management will not work properly until you have restarted, you will also need to re-enter the lights-out management settings in Server Monitor.";

/* MainText shutdown and unplug required */
"Your Xserve must be shut down and unplugged for one minute, then you may plug it back in and start up normally." = "Your Xserve must be shut down and unplugged for one minute, then you may plug it back in and start up normally.";

